cases/u_9kv_2khz_case2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dbdFlowSimple;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3000;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   1000;

purgeWrite      1;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

maxCo           5;

functions   
{
// #includeFunc  residuals
// #includeFunc  yPlus 
// #includeFunc  vorticity 
// #includeFunc  wallShearStress

// 	probes
//     {
//         type            probes;
//         libs            ("libsampling.so");
//         writeControl    timeStep;
//         writeInterval   1;

//         fields	(p U k);

//         probeLocations
//         (
//             (0.003 0.0005 -0.005)
//         );
	
//     }

};

// ************************************************************************* //
