cases/u_9kv_2khz_case2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            patch;
        nFaces          146;
        startFace       22506;
    }
    inlet
    {
        type            patch;
        nFaces          82;
        startFace       22652;
    }
    outlet
    {
        type            patch;
        nFaces          82;
        startFace       22734;
    }
    exposed
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       22816;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          86;
        startFace       22896;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11372;
        startFace       22982;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11372;
        startFace       34354;
    }
)

// ************************************************************************* //
