cases/u_9kv_2khz_case2/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; // [m/s]

internalField   uniform (1.0E-3 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.0E-1 0 0);
    }
    
    outlet
    {
        type            zeroGradient; 
    }

    exposed        
    {    
        type            noSlip;
    }
    
    wall      
    {   
        type            noSlip;
    }

    top
    {
        type            slip;
    }

    front     
    {
        type            empty; 
    }
   
    back 
    {
        type            empty;      
    }

}


// ************************************************************************* //
