cases/u_9kv_2khz_case2/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];; // [m^2/s^2]

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            zeroGradient; 
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform  0; 
    }

    exposed        
    {    
        type            zeroGradient;
    }
    
    wall      
    {   
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    front     
    {
        type            empty; 
    }
   
    back 
    {
        type            empty;      
    }

}


// ************************************************************************* //
