cases/u_9kv_2khz_case2/0.orig/ehdForce
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    object          ehdForce;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -2 -2 0 0 0 0]; // [kg /( m s^2)]

internalField   uniform ( 0 0 0 );

boundaryField
{

    front     
    {
        type            empty; 
    }
   
    back 
    {
        type            empty;      
    }

    ".*"        
    {    
        type            zeroGradient; 
    }

}


// ************************************************************************* //
