cases/u_9kv_2khz_case2/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 30.618;

boundaryField
{
	
	inlet
	{
		type            fixedValue;
        value           $internalField;
    }
	
	outlet
	{
		type            zeroGradient; 
    }

	exposed        
    {    
		type            omegaWallFunction;
        value           $internalField;
	}
	
	wall      
    {   
		type            omegaWallFunction;
        value           $internalField;
    }

	top
	{
		type            zeroGradient; 
    }

    front     
    {
		type            empty; 
    }
   
	back 
	{
		type            empty;  	
	}

}

// ************************************************************************* //