cases/u_9kv_2khz_case2/0.orig/phiE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          phiE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 2 -3 0 0 -1 0]; // [kg * m^2 /( s^3 A)]

internalField   uniform 0;

boundaryField
{
    front     
    {
        type            empty;  
    }
   
    back 
    {
        type            empty;      
    }
    
    ".*"      
    {   
        type            zeroGradient; 
    }

}


// ************************************************************************* //
